{
"Footer": {
    "made_with": "Made with",
    "by_me": "by me",
    "imprint": "Imprint",
    "privacy": "Privacy Policy"
  },
  "HomePage": {
    "code": "Code",
    "photos": "Photos"
  },
  "GalleryLightbox": {
    "dialogTitle": "{prefix} - Image {index}",
    "imageAlt": "{prefix} - Image {index}",
    "previousImage": "Previous image",
    "nextImage": "Next image",
    "close": "Close lightbox"
  },
  "ImprintPage": {
    "title": "Imprint",
    "section1_title": "Information pursuant to ยง 5 TMG",
    "section1_content": [
      "[Your Name]",
      "[Your Street and House Number]",
      "[Your Postal Code and City]",
      "Germany"
    ],
    "section2_title": "Contact",
    "section2_content": [
      "Phone: [Your Phone Number (optional)]",
      "Email: [Your Email Address]"
    ],
    "section3_title": "Person responsible for content pursuant to ยง 18 Abs. 2 MStV",
    "section3_content": [
      "[Your Name]",
      "[Your Address, if different from above]"
    ],
    "disclaimer_title": "Disclaimer",
    "disclaimer_links_title": "Liability for Links",
    "disclaimer_links_content": "Our site contains links to external third-party websites, over whose content we have no influence. Therefore, we cannot assume any liability for this external content. The respective provider or operator of the pages is always responsible for the content of the linked pages.",
    "disclaimer_copyright_title": "Copyright",
    "disclaimer_copyright_content": "The content and works created by the site operators on these pages are subject to German copyright law. The reproduction, processing, distribution, and any kind of exploitation outside the limits of copyright require the written consent of the respective author or creator."
  },
  "PrivacyPage": {
    "title": "Privacy Policy",
    "section1_title": "1. Data Protection at a Glance",
    "section1_content": "This privacy policy informs you about the nature, scope, and purpose of the processing of personal data on our website.",
    "section2_title": "Data Controller",
    "section2_content": [
      "[Your Name]",
      "[Your Street and House Number]",
      "[Your Postal Code and City]",
      "Email: [Your Email Address]"
    ],
    "section3_title": "2. Data Collection on This Website",
    "section3_hosting_title": "Hosting and Server Log Files",
    "section3_hosting_content": "Our website is hosted by Vercel Inc., 340 S Lemon Ave #4133, Walnut, CA 91789, USA. Vercel automatically collects information in server log files each time the website is accessed. This data is not merged with other data sources. The basis for this data processing is Art. 6(1)(f) GDPR.",
    "section3_analytics_title": "Analytics by Vercel Analytics & Speed Insights",
    "section3_analytics_content": "We use the services Vercel Analytics and Speed Insights from our host, Vercel Inc. These services are designed to be privacy-friendly, do not collect personal data that would allow for user identification, and do not use cookies. The legal basis is our legitimate interest (Art. 6(1)(f) GDPR) in the analysis and optimization of our website.",
    "section3_contact_title": "Contact Form via Formspree",
    "section3_contact_content": "When you use our contact form, your provided information is transmitted to and processed by the service provider Formspree, Inc., 1201 Orange St, Ste 600, Wilmington, DE 19801, USA, to handle your request. The processing of this data is based on your consent (Art. 6(1)(a) GDPR).",
    "section4_title": "3. Your Rights as a Data Subject",
    "section4_content": "Within the framework of the applicable legal provisions, you have the right at any time to free information about your stored personal data, its origin and recipients, and the purpose of the data processing, and, if applicable, a right to correction or deletion of this data."
  }
}